duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_ICON_X, SETTINGS_MENU_RESET_ICON_Y, IMG_RESET_LOGO_ADDR);
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_NO_X, SETTINGS_MENU_RESET_NO_Y, IMG_RESET_NO_ADDR);
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_YES_X, SETTINGS_MENU_RESET_YES_Y, IMG_RESET_YES_ADDR);

					switch(global_settings.language)
					{
				  #ifndef FW_FOR_CN	
					case LANGUAGE_DE:
					case LANGUAGE_GR:
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX-2);
						break;
					case LANGUAGE_JP:
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX-18);
						break;
				  #endif
				  
					default:
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX);
						break;
					}
					LCD_MeasureUniString(tmpbuf, &w, &h);
					if(g_language_r2l)
						LCD_ShowUniString(LCD_WIDTH-(SETTINGS_MENU_RESET_STR_X+(SETTINGS_MENU_RESET_STR_W-w)/2), 
										SETTINGS_MENU_RESET_STR_Y+(SETTINGS_MENU_RESET_STR_H-h)/2, 
										tmpbuf);
					else
						LCD_ShowUniString(SETTINGS_MENU_RESET_STR_X+(SETTINGS_MENU_RESET_STR_W-w)/2, 
										SETTINGS_MENU_RESET_STR_Y+(SETTINGS_MENU_RESET_STR_H-h)/2, 
										tmpbuf);
				#ifdef CONFIG_TOUCH_SUPPORT
					register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
												SETTINGS_MENU_RESET_NO_X, 
												SETTINGS_MENU_RESET_NO_X+SETTINGS_MENU_RESET_NO_W, 
												SETTINGS_MENU_RESET_NO_Y, 
												SETTINGS_MENU_RESET_NO_Y+SETTINGS_MENU_RESET_NO_H, 
												settings_menu.sel_handler[0]);
					register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
												SETTINGS_MENU_RESET_YES_X, 
												SETTINGS_MENU_RESET_YES_X+SETTINGS_MENU_RESET_YES_W, 
												SETTINGS_MENU_RESET_YES_Y, 
												SETTINGS_MENU_RESET_YES_Y+SETTINGS_MENU_RESET_YES_H, 
												settings_menu.sel_handler[1]);
				#endif	
				}
				break;
				
			case RESET_STATUS_RUNNING:
				{
					uint16_t str_running[LANGUAGE_MAX][28] = {
															#ifndef FW_FOR_CN
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0020,0x0069,0x006E,0x0020,0x0070,0x0072,0x006F,0x0067,0x0072,0x0065,0x0073,0x0073,0x0000},//Resetting in progress
																{0x005A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0075,0x006E,0x0067,0x0020,0x006C,0x00E4,0x0075,0x0066,0x0074,0x0000},//Zurücksetzung l?uft
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0061,0x0074,0x0069,0x006F,0x006E,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x0000},//Réinitialisation en cours
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x0061,0x0020,0x0069,0x006E,0x0020,0x0063,0x006F,0x0072,0x0073,0x006F,0x0000},//Ripristina in corso
																{0x0052,0x0065,0x0069,0x006E,0x0069,0x0063,0x0069,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0065,0x006E,0x0020,0x0063,0x0075,0x0072,0x0073,0x006F,0x0000},//Reinicialización en curso
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x00E7,0x00E3,0x006F,0x0020,0x0065,0x006D,0x0020,0x0061,0x006E,0x0064,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0000},//Redefini??o em andamento
																{0x0054,0x0072,0x0077,0x0061,0x0020,0x0072,0x0065,0x0073,0x0065,0x0074,0x006F,0x0077,0x0061,0x006E,0x0069,0x0065,0x0000},//Trwa resetowanie
																{0x00C5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x0065,0x0072,0x0020,0x0070,0x00E5,0x0067,0x00E5,0x0072,0x002E,0x002E,0x002E,0x0000},//?terst?ller p?g?r...
																{0x30EA,0x30BB,0x30C3,0x30C8,0x4E2D,0x002E,0x002E,0x002E,0x0000},//リセット中...
																{0xC7AC,0xC124,0xC815,0x0020,0xC9C4,0xD589,0x0020,0xC911,0x0000},//??? ?? ?
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x0432,0x0020,0x043F,0x0440,0x043E,0x0446,0x0435,0x0441,0x0441,0x0435,0x0000},//Сброс в процессе
																{0x062C,0x0627,0x0631,0x064A,0x0020,0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x0636,0x0628,0x0637,0x0000},//???? ????? ?????
															#else
																{0x91CD,0x7F6E,0x8FDB,0x884C,0x4E2D,0x0000},//重置进行中
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0020,0x0069,0x006E,0x0020,0x0070,0x0072,0x006F,0x0067,0x0072,0x0065,0x0073,0x0073,0x0000},//Resetting in progress
															#endif
															  };
					uint32_t img_addr[8] = {
											IMG_RESET_ANI_1_ADDR,
											IMG_RESET_ANI_2_ADDR,
											IMG_RESET_ANI_3_ADDR,
											IMG_RESET_ANI_4_ADDR,
											IMG_RESET_ANI_5_ADDR,
											IMG_RESET_ANI_6_ADDR,
											IMG_RESET_ANI_7_ADDR,
											IMG_RESET_ANI_8_ADDR
										};

					mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_running[global_settings.language], MENU_NOTIFY_STR_MAX);
					LCD_MeasureUniString(tmpbuf, &w, &h);
					if(g_language_r2l)
						LCD_ShowUniString(LCD_WIDTH-(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2), 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
					else
						LCD_ShowUniString(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2, 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
				#ifdef CONFIG_ANIMATION_SUPPORT
					AnimaShow(SETTINGS_MENU_RESET_LOGO_X, SETTINGS_MENU_RESET_LOGO_Y, img_addr, ARRAY_SIZE(img_addr), 300, true, NULL);
				#endif	
				}
				break;
				
			case RESET_STATUS_SUCCESS:
				{
					uint16_t str_success[LANGUAGE_MAX][26] = {
															#ifndef FW_FOR_CN
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0053,0x0075,0x0063,0x0063,0x0065,0x0073,0x0073,0x0066,0x0075,0x006C,0x0000},//Reset Successful
																{0x005A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0065,0x006E,0x0020,0x0065,0x0072,0x0066,0x006F,0x006C,0x0067,0x0072,0x0065,0x0069,0x0063,0x0068,0x0000},//Zurücksetzen erfolgreich
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0065,0x0072,0x0020,0x006C,0x0065,0x0020,0x0073,0x0075,0x0063,0x0063,0x00E8,0x0073,0x0000},//Réinitialiser le succès
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x006F,0x0020,0x0072,0x0069,0x0075,0x0073,0x0063,0x0069,0x0074,0x006F,0x0000},//Ripristino riuscito
																{0x0052,0x0065,0x0073,0x0074,0x0061,0x0062,0x006C,0x0065,0x0063,0x0069,0x006D,0x0069,0x0065,0x006E,0x0074,0x006F,0x0020,0x00E9,0x0078,0x0069,0x0074,0x006F,0x0000},//Restablecimiento éxito
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x0072,0x0020,0x0062,0x0065,0x006D,0x0020,0x002D,0x0073,0x0075,0x0063,0x0065,0x0064,0x0069,0x0064,0x006F,0x0000},//Redefinir bem -sucedido
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x007A,0x0061,0x006B,0x006F,0x0144,0x0063,0x007A,0x006F,0x006E,0x0079,0x0000},//Reset zakończony
																{0x00C5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x006E,0x0069,0x006E,0x0067,0x0020,0x0073,0x006C,0x0075,0x0074,0x0066,0x00F6,0x0072,0x0064,0x0021,0x0000},//?terst?llning slutf?rd!
																{0x30EA,0x30BB,0x30C3,0x30C8,0x6210,0x529F,0x0000},//リセット成功
																{0xBCF5,0xAD6C,0x0020,0xCD08,0xAE30,0xD654,0x0020,0xC131,0xACF5,0x0000},//?? ??? ??
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x0432,0x044B,0x043F,0x043E,0x043B,0x043D,0x0435,0x043D,0x0000},//Сброс выполнен
																{0x0646,0x062C,0x0627,0x062D,0x062A,0x0645,0x062A,0x0020,0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x0636,0x0628,0x0637,0x0020,0x0628,0x0000},//??? ????? ????? ?????
															#else
																{0x51FA,0x5382,0x8BBE,0x7F6E,0x6062,0x590D,0x6210,0x529F,0x0000},//出厂设置恢复成功
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0053,0x0075,0x0063,0x0063,0x0065,0x0073,0x0073,0x0066,0x0075,0x006C,0x0000},//Reset Successful
															#endif
															  };
					
				#ifdef CONFIG_ANIMATION_SUPPORT
					AnimaStop();
				#endif

