duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	case NOTIFY_ALIGN_BOUNDARY:
		x = (notify_msg.x+offset_w);
		y = (notify_msg.y+offset_h);
		LCD_ShowUniStringInRect(x, y, (notify_msg.w-2*offset_w), (notify_msg.h-2*offset_h), notify_msg.text);
		break;
	}
}

void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		NotifyUpdate();
		break;

	case SCREEN_ACTION_EXIT:
		ExitNotifyScreen();
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
}

#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
uint16_t dl_idle_notify_en[] = 
{
	////Please ensure the battery level is over 80% or the charger is connected.
	0x0050,0x006C,0x0065,0x0061,0x0073,0x0065,0x0020,0x0065,0x006E,0x0073,0x0075,0x0072,0x0065,0x0020,0x0074,0x0068,0x0065,0x0020,
	0x0062,0x0061,0x0074,0x0074,0x0065,0x0072,0x0079,0x0020,0x006C,0x0065,0x0076,0x0065,0x006C,0x0020,0x0069,0x0073,0x0020,0x006F,
	0x0076,0x0065,0x0072,0x0020,0x0038,0x0030,0x0025,0x0020,0x006F,0x0072,0x0020,0x0074,0x0068,0x0065,0x0020,0x0063,0x0068,0x0061,
	0x0072,0x0067,0x0065,0x0072,0x0020,0x0069,0x0073,0x0063,0x006F,0x006E,0x006E,0x0065,0x0063,0x0074,0x0065,0x0064,0x002E,0x0000
};
#ifndef FW_FOR_CN
uint16_t dl_idle_notify_de[] = 
{
	//Stellen Sie sicher, dass der Akkustand über 80 % liegt oder das Ladekabel angeschlossen ist.
	0x0053,0x0074,0x0065,0x006C,0x006C,0x0065,0x006E,0x0020,0x0053,0x0069,0x0065,0x0020,0x0073,0x0069,0x0063,0x0068,0x0065,0x0072,
	0x002C,0x0020,0x0064,0x0061,0x0073,0x0073,0x0020,0x0064,0x0065,0x0072,0x0020,0x0041,0x006B,0x006B,0x0075,0x0073,0x0074,0x0061,
	0x006E,0x0064,0x0020,0x00FC,0x0062,0x0065,0x0072,0x0020,0x0038,0x0030,0x0020,0x0025,0x0020,0x006C,0x0069,0x0065,0x0067,0x0074,
	0x0020,0x006F,0x0064,0x0065,0x0072,0x0020,0x0064,0x0061,0x0073,0x0020,0x004C,0x0061,0x0064,0x0065,0x006B,0x0061,0x0062,0x0065,
	0x006C,0x0020,0x0061,0x006E,0x0067,0x0065,0x0073,0x0063,0x0068,0x006C,0x006F,0x0073,0x0073,0x0065,0x006E,0x0020,0x0069,0x0073,
	0x0074,0x002E,0x0000
};
uint16_t dl_idle_notify_fr[] =
{
	//Assurez-vous que le niveau de batterie est supérieur à 80 % ou que le c?ble de chargement est connecté.
	0x0041,0x0073,0x0073,0x0075,0x0072,0x0065,0x007A,0x2013,0x0076,0x006F,0x0075,0x0073,0x0020,0x0071,0x0075,0x0065,0x0020,0x006C,
	0x0065,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,0x0020,0x0062,0x0061,0x0074,0x0074,0x0065,0x0072,
	0x0069,0x0065,0x0020,0x0065,0x0073,0x0074,0x0020,0x0073,0x0075,0x0070,0x00E9,0x0072,0x0069,0x0065,0x0075,0x0072,0x0020,0x00E0,
	0x0020,0x0038,0x0030,0x0020,0x0025,0x0020,0x006F,0x0075,0x0020,0x0071,0x0075,0x0065,0x0020,0x006C,0x0065,0x0020,0x0063,0x00E2,
	0x0062,0x006C,0x0065,0x0020,0x0064,0x0065,0x0020,0x0063,0x0068,0x0061,0x0072,0x0067,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,
	0x0065,0x0073,0x0074,0x0020,0x0063,0x006F,0x006E,0x006E,0x0065,0x0063,0x0074,0x00E9,0x002E,0x0000
};
uint16_t dl_idle_notify_it[] =
{
	//Assicurarsi che il livello della batteria sia superiore all'80% o che il cavo di ricarica sia collegato.
	0x0041,0x0073,0x0073,0x0069,0x0063,0x0075,0x0072,0x0061,0x0072,0x0073,0x0069,0x0020,0x0063,0x0068,0x0065,0x0020,0x0069,0x006C,
	0x0020,0x006C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0064,0x0065,0x006C,0x006C,0x0061,0x0020,0x0062,0x0061,0x0074,
	0x0074,0x0065,0x0072,0x0069,0x0061,0x0020,0x0073,0x0069,0x0061,0x0020,0x0073,0x0075,0x0070,0x0065,0x0072,0x0069,0x006F,0x0072,
	0x0065,0x0061,0x006C,0x006C,0x0027,0x0038,0x0030,0x0025,0x0020,0x006F,0x0020,0x0063,0x0068,0x0065,0x0020,0x0069,0x006C,0x0020,
	0x0063,0x0061,0x0076,0x006F,0x0020,0x0064,0x0069,0x0020,0x0072,0x0069,0x0063,0x0061,0x0072,0x0069,0x0063,0x0061,0x0020,0x0073,
	0x0069,0x0061,0x0020,0x0063,0x006F,0x006C,0x006C,0x0065,0x0067,0x0061,0x0074,0x006F,0x002E,0x0000
};
uint16_t dl_idle_notify_es[] =
{
	//Asegúrate de que el nivel de la batería es superior al 80% o de que el cable de carga está conectado.
	0x0041,0x0073,0x0065,0x0067,0x00FA,0x0072,0x0061,0x0074,0x0065,0x0020,0x0064,0x0065,0x0020,0x0071,0x0075,0x0065,0x0020,0x0065,
	0x006C,0x0020,0x006E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0064,0x0065,0x0020,0x006C,0x0061,0x0020,0x0062,0x0061,0x0074,0x0065,
	0x0072,0x00ED,0x0061,0x0020,0x0065,0x0073,0x0020,0x0073,0x0075,0x0070,0x0065,0x0072,0x0069,0x006F,0x0072,0x0020,0x0061,0x006C,
	0x0020,0x0038,0x0030,0x0025,0x0020,0x006F,0x0020,0x0064,0x0065,0x0020,0x0071,0x0075,0x0065,0x0020,0x0065,0x006C,0x0020,0x0063,
	0x0061,0x0062,0x006C,0x0065,0x0020,0x0064,0x0065,0x0020,0x0063,0x0061,0x0072,0x0067,0x0061,0x0020,0x0065,0x0073,0x0074,0x00E1,
	0x0020,0x0063,0x006F,0x006E,0x0065,0x0063,0x0074,0x0061,0x0064,0x006F,0x002E,0x0000
};
uint16_t dl_idle_notify_pt[] =
{
	//Certifique-se de que o nível da bateria é superior a 80% ou que o cabo de carregamento está ligado.
	0x0043,0x0065,0x0072,0x0074,0x0069,0x0066,0x0069,0x0071,0x0075,0x0065,0x2013,0x0073,0x0065,0x0020,0x0064,0x0065,0x0020,0x0071,
	0x0075,0x0065,0x0020,0x006F,0x0020,0x006E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0064,0x0061,0x0020,0x0062,0x0061,0x0074,0x0065,
	0x0072,0x0069,0x0061,0x0020,0x00E9,0x0020,0x0073,0x0075,0x0070,0x0065,0x0072,0x0069,0x006F,0x0072,0x0061,0x0038,0x0030,0x0025,
	0x0020,0x006F,0x0075,0x0020,0x0071,0x0075,0x0065,0x0020,0x006F,0x0020,0x0063,0x0061,0x0062,0x006F,0x0020,0x0064,0x0065,0x0020,
	0x0063,0x0061,0x0072,0x0072,0x0065,0x0067,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0065,0x0073,0x0074,0x00E1,0x0020,
	0x006C,0x0069,0x0067,0x0061,0x0064,0x006F,0x002E,0x0000
};
uint16_t dl_idle_notify_pl[] =
{
	//Sprawd?, czy poziom na?adowania baterii wynosi ponad 80% lub czy ?adowarka jest pod??czona.
	0x0053,0x0070,0x0072,0x0061,0x0077,0x0064,0x017A,0x002C,0x0020,0x0063,0x007A,0x0079,0x0020,0x0070,0x006F,0x007A,0x0069,0x006F,
	0x006D,0x0020,0x006E,0x0061,0x0142,0x0061,0x0064,0x006F,0x0077,0x0061,0x006E,0x0069,0x0061,0x0020,0x0062,0x0061,0x0074,0x0065,
	0x0072,0x0069,0x0069,0x0020,0x0077,0x0079,0x006E,0x006F,0x0073,0x0069,0x0020,0x0070,0x006F,0x006E,0x0061,0x0064,0x0020,0x0038,
	0x0030,0x0025,0x0020,0x006C,0x0075,0x0062,0x0020,0x0063,0x007A,0x0079,0x0020,0x0142,0x0061,0x0064,0x006F,0x0077,0x0061,0x0072,
	0x006B,0x0061,0x0020,0x006A,0x0065,0x0073,0x0074,0x0020,0x0070,0x006F,0x0064,0x0142,0x0105,0x0063,0x007A,0x006F,0x006E,0x0061,
	0x002E,0x0000
};
