duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
uint16_t dl_idle_notify_se[] =
{
	//V?nligen s?kerst?ll att batteriniv?n ?r ?ver 80% eller att laddaren ?r ansluten.
	0x0056,0x00E4,0x006E,0x006C,0x0069,0x0067,0x0065,0x006E,0x0020,0x0073,0x00E4,0x006B,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,
	0x006C,0x0020,0x0061,0x0074,0x0074,0x0020,0x0062,0x0061,0x0074,0x0074,0x0065,0x0072,0x0069,0x006E,0x0069,0x0076,0x00E5,0x006E,
	0x0020,0x00E4,0x0072,0x0020,0x00F6,0x0076,0x0065,0x0072,0x0020,0x0038,0x0030,0x0025,0x0020,0x0065,0x006C,0x006C,0x0065,0x0072,
	0x0020,0x0061,0x0074,0x0074,0x0020,0x006C,0x0061,0x0064,0x0064,0x0061,0x0072,0x0065,0x006E,0x00E4,0x0072,0x0020,0x0061,0x006E,
	0x0073,0x006C,0x0075,0x0074,0x0065,0x006E,0x002E,0x0000
};
uint16_t dl_idle_notify_jp[] =
{
	//バッテリーが80%以上、または充電器が接続中であることを確認してください。
	0x30D0,0x30C3,0x30C6,0x30EA,0x30FC,0x304C,0x0038,0x0030,0x0025,0x4EE5,0x4E0A,0x3001,0x307E,0x305F,0x306F,0x5145,0x96FB,0x5668,
	0x304C,0x63A5,0x7D9A,0x4E2D,0x3067,0x3042,0x308B,0x3053,0x3068,0x3092,0x78BA,0x8A8D,0x3057,0x3066,0x304F,0x3060,0x3055,0x3044,
	0x3002,0x0000
};
uint16_t dl_idle_notify_kr[] =
{
	//???? 80% ?? ?????? ???? ???? ??? ?????.
	0xBC30,0xD130,0xB9AC,0xAC00,0x0020,0x0038,0x0030,0x0025,0x0020,0xC774,0xC0C1,0x0020,0xCDA9,0xC804,0xB418,0xC5C8,0xAC70,0xB098,
	0x0020,0xCDA9,0xC804,0xAE30,0xAC00,0x0020,0xC5F0,0xACB0,0xB418,0xC5B4,0x0020,0xC788,0xB294,0xC9C0,0x0020,0xD655,0xC778,0xD558,
	0xC138,0xC694,0x002E,0x0000
};
uint16_t dl_idle_notify_ru[] =
{
	//Убедитесь, что заряд батареи выше 80% или зарядное устройство подключено.
	0x0423,0x0431,0x0435,0x0434,0x0438,0x0442,0x0435,0x0441,0x044C,0x002C,0x0020,0x0447,0x0442,0x043E,0x0020,0x0437,0x0430,0x0440,
	0x044F,0x0434,0x0020,0x0431,0x0430,0x0442,0x0430,0x0440,0x0435,0x0438,0x0020,0x0432,0x044B,0x0448,0x0435,0x0020,0x0038,0x0030,
	0x0025,0x0020,0x0438,0x043B,0x0438,0x0020,0x0437,0x0430,0x0440,0x044F,0x0434,0x043D,0x043E,0x0435,0x0020,0x0443,0x0441,0x0442,
	0x0440,0x043E,0x0439,0x0441,0x0442,0x0432,0x043E,0x0020,0x043F,0x043E,0x0434,0x043A,0x043B,0x044E,0x0447,0x0435,0x043D,0x043E,
	0x002E,0x0000
};
uint16_t dl_idle_notify_ar[] =
{
	//???? ?? ?? ????? ???????? ???? ?? 80% ?? ?? ???? ????? ????.
	0x062A,0x0623,0x0643,0x062F,0x0020,0x0645,0x0646,0x0020,0x0623,0x0646,0x0020,0x0645,0x0633,0x062A,0x0648,0x0649,0x0020,0x0627,
	0x0644,0x0628,0x0637,0x0627,0x0631,0x064A,0x0629,0x0020,0x0623,0x0639,0x0644,0x0649,0x0020,0x0645,0x0646,0x0020,0x0038,0x0030,
	0x0025,0x0020,0x0623,0x0648,0x0020,0x0623,0x0646,0x0020,0x0643,0x0627,0x0628,0x0644,0x0020,0x0627,0x0644,0x0634,0x062D,0x0646,
	0x0020,0x0645,0x062A,0x0635,0x0644,0x002E,0x0000
};
#else
uint16_t dl_idle_notify_cn[] = 
{
	//确保电量大于80%或者充电器已经连接。
	0x786E,0x4FDD,0x7535,0x91CF,0x5927,0x4E8E,0x0038,0x0030,0x0025,0x6216,0x8005,0x5145,0x7535,0x5668,0x5DF2,0x7ECF,0x8FDE,0x63A5,
	0x3002,0x0000
};
#endif/*FW_FOR_CN*/

void DlShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t str_title[128] = {0};
	uint16_t *str_notify[LANGUAGE_MAX] = {
										#ifndef FW_FOR_CN
											dl_idle_notify_en,
											dl_idle_notify_de,
											dl_idle_notify_fr,
											dl_idle_notify_it,
											dl_idle_notify_es,
											dl_idle_notify_pt,
											dl_idle_notify_pl,
											dl_idle_notify_se,
											dl_idle_notify_jp,
											dl_idle_notify_kr,
											dl_idle_notify_ru,
											dl_idle_notify_ar,
										#else
											dl_idle_notify_cn,
											dl_idle_notify_en,
										#endif
										};
	uint16_t str_ui_title[LANGUAGE_MAX][41] = {
										#ifndef FW_FOR_CN
											{
												//UI Upgrade
												0x0055,0x0049,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
											{
												//UI-Upgrade
												0x0055,0x0049,0x2013,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
											{
												//Mise à niveau de l'interface utilisateur
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0027,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x0063,0x0065,0x0020,0x0075,0x0074,0x0069,
												0x006C,0x0069,0x0073,0x0061,0x0074,0x0065,0x0075,0x0072,0x0000
											},
											{
												//Aggiornamento dell'interfaccia utente
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x006C,0x0027,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x0063,0x0063,0x0069,0x0061,0x0020,0x0075,
												0x0074,0x0065,0x006E,0x0074,0x0065,0x0000
											},
											{
												//Actualización de la interfaz de usuario
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0061,0x0020,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x007A,0x0020,0x0064,0x0065,0x0020,
												0x0075,0x0073,0x0075,0x0061,0x0072,0x0069,0x006F,0x0000
											},
											{
												//Atualiza??o da IU
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x0061,0x0020,0x0049,
												0x0055,0x0000
											},
											{
												//Aktualizacja interfejsu u?ytkownika
												0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0069,0x006E,0x0074,
												0x0065,0x0072,0x0066,0x0065,0x006A,0x0073,0x0075,0x0020,0x0075,0x017C,0x0079,0x0074,0x006B,0x006F,0x0077,0x006E,
												0x0069,0x006B,0x0061,0x0000
											},
											{
												//Uppgradering av UI
												0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x0061,0x0076,0x0020,
												0x0055,0x0049,0x0000
											},
											{
												//UI アップグレード
												0x0055,0x0049,0x0020,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x0000
											},
											{
												//UI ?????
												0x0055,0x0049,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
											{
												//Обновление пользовательского интерфейса
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x043F,0x043E,0x043B,0x044C,0x0437,
												0x043E,0x0432,0x0430,0x0442,0x0435,0x043B,0x044C,0x0441,0x043A,0x043E,0x0433,0x043E,0x0020,0x0438,0x043D,0x0442,
												0x0435,0x0440,0x0444,0x0435,0x0439,0x0441,0x0430,0x0000
											},
											{
												//????? ????? ????????
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0648,0x0627,0x062C,0x0647,0x0629,0x0020,0x0627,0x0644,0x0645,0x0633,
												0x062A,0x062E,0x062F,0x0645,0x0000
											},
										#else
											{
												//图库升级
												0x56FE,0x5E93,0x5347,0x7EA7,0x0000
											},
											{
												//UI Upgrade
												0x0055,0x0049,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										#endif
										};
	uint16_t str_font_title[LANGUAGE_MAX][28] = {
										#ifndef FW_FOR_CN
											{
												//Font Upgrade
												0x0046,0x006F,0x006E,0x0074,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
											{
												//Schriftart-Upgrade
												0x0053,0x0063,0x0068,0x0072,0x0069,0x0066,0x0074,0x0061,0x0072,0x0074,0x2013,0x0055,0x0070,0x0067,0x0072,0x0061,
												0x0064,0x0065,0x0000
											},
											{
												//Mise à jour de la police
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0064,0x0065,0x0020,0x006C,
												0x0061,0x0020,0x0070,0x006F,0x006C,0x0069,0x0063,0x0065,0x0000
											},
											{
												//Aggiornamento del carattere
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x0020,0x0063,0x0061,0x0072,0x0061,0x0074,0x0074,0x0065,0x0072,0x0065,0x0000
											},
											{
												//Actualización de fuentes
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x0020,0x0066,0x0075,0x0065,0x006E,0x0074,0x0065,0x0073,0x0000
											},
											{
												//Atualiza??o de fonte
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x0065,0x0020,0x0066,
												0x006F,0x006E,0x0074,0x0065,0x0000
											},
											{
												//Uaktualnienie czcionki
												0x0055,0x0061,0x006B,0x0074,0x0075,0x0061,0x006C,0x006E,0x0069,0x0065,0x006E,0x0069,0x0065,0x0020,0x0063,0x007A,
												0x0063,0x0069,0x006F,0x006E,0x006B,0x0069,0x0000
											},
											{
												//Teckensnittsuppgradering
												0x0054,0x0065,0x0063,0x006B,0x0065,0x006E,0x0073,0x006E,0x0069,0x0074,0x0074,0x0073,0x0075,0x0070,0x0070,0x0067,
												0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0000
											},
											{
												//フォントのアップグレード
												0x30D5,0x30A9,0x30F3,0x30C8,0x306E,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x0000
											},
											{
												//?? ?????
												0xAE00,0xAF34,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
											{
												//Обновление шрифта
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0448,0x0440,0x0438,0x0444,0x0442,
												0x0430,0x0000
											},
											{
												//????? ????
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0627,0x0644,0x062E,0x0637,0x0000
											},
										#else
											{
												//字库升级
												0x5B57,0x5E93,0x5347,0x7EA7,0x0000
											},
											{
												//Font Upgrade
												0x0046,0x006F,0x006E,0x0074,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										#endif
										};
	uint16_t str_ppg_ag_title[LANGUAGE_MAX][34] = {
										#ifndef FW_FOR_CN
											{
												//PPG algorithm Upgrade
												0x0050,0x0050,0x0047,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0020,0x0055,0x0070,
												0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
											{
												//PPG-Algorithmus-Upgrade
												0x0050,0x0050,0x0047,0x2013,0x0041,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0075,0x0073,0x2013,
												0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
											{
												//Mise à niveau de l'algorithme PPG
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0027,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0065,0x0020,0x0050,0x0050,
												0x0047,0x0000
											},
											{
												//Aggiornamento dell'algoritmo PPG
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x006C,0x0027,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,
												0x0000
											},
											{
												//Actualización del algoritmo PPG
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x006C,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,0x0000
											},
											{
												//Atualiza??o do algoritmo PPG
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x006F,0x0020,0x0061,
												0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,0x0000
											},
											{
												//Aktualizacja algorytmu PPG
												0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0061,0x006C,0x0067,
												0x006F,0x0072,0x0079,0x0074,0x006D,0x0075,0x0020,0x0050,0x0050,0x0047,0x0000
											},
											{
												//Uppgradering av PPG-algoritm
												0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x0061,0x0076,0x0020,
												0x0050,0x0050,0x0047,0x2013,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x0000
											},
											{
												//PPGアルゴリズムのアップグレード
												0x0050,0x0050,0x0047,0x30A2,0x30EB,0x30B4,0x30EA,0x30BA,0x30E0,0x306E,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,
												0x30C9,0x0000
											},
											{
												//PPG ???? ?????
												0x0050,0x0050,0x0047,0x0020,0xC54C,0xACE0,0xB9AC,0xC998,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
											{
												//Обновление алгоритма PPG
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0430,0x043B,0x0433,0x043E,0x0440,
												0x0438,0x0442,0x043C,0x0430,0x0020,0x0050,0x0050,0x0047,0x0000
											},
											{
												//????? ???????? PPG
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x062E,0x0648,0x0627,0x0631,0x0632,0x0645,0x064A,0x0629,0x0050,0x0050,
												0x0047,0x0000
											},
										#else
											{
												//PPG算法升级
												0x0050,0x0050,0x0047,0x7B97,0x6CD5,0x5347,0x7EA7,0x0000
											},
											{
												//PPG algorithm Upgrade
												0x0050,0x0050,0x0047,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0020,0x0055,0x0070,
												0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										#endif
										};

	LCD_Clear(BLACK);

	switch(g_dl_data_type)
	{
	case DL_DATA_IMG:
	#ifdef FONTMAKER_UNICODE_FONT
		mmi_ucs2smartcpy(str_title, (uint8_t*)str_ui_title[global_settings.language], 18);
	#else
		strcpy(str_title, "UI Upgrade");
	#endif
		break;
	case DL_DATA_FONT:
	#ifdef FONTMAKER_UNICODE_FONT
		mmi_ucs2smartcpy(str_title, (uint8_t*)str_font_title[global_settings.language], 18);
	#else
		strcpy(str_title, "FONT Upgrade");
	#endif
		break;
	case DL_DATA_PPG:
	#ifdef FONTMAKER_UNICODE_FONT
		mmi_ucs2smartcpy(str_title, (uint8_t*)str_ppg_ag_title[global_settings.language], 18);
	#else
		strcpy(str_title, "PPG_AG Upgrade");
	#endif
		break;
	}

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif

#ifdef FONTMAKER_UNICODE_FONT
	LCD_MeasureUniString((uint16_t*)str_title, &w, &h);
	x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : ((DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W)-w)/2;
	x += (DL_NOTIFY_RECT_X+DL_NOTIFY_OFFSET_W);
	y = 25;
	LCD_ShowUniString(x, y, (uint16_t*)str_title);
#else
	LCD_MeasureString(str_title, &w, &h);
	x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : ((DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W)-w)/2;
	x += (DL_NOTIFY_RECT_X+DL_NOTIFY_OFFSET_W);
	y = 25;
	LCD_ShowString(x,y,str_title);
#endif

#ifdef FONTMAKER_UNICODE_FONT
	LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_notify[global_settings.language]);
#else
	ShowStringsInRect(DL_NOTIFY_STRING_X, 
					  DL_NOTIFY_STRING_Y, 
					  DL_NOTIFY_STRING_W, 
					  DL_NOTIFY_STRING_H, 
					  "Make sure the battery is more than 80% full or the charger is connected.");
#endif
	LCD_DrawRectangle(DL_NOTIFY_YES_X, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
	LCD_MeasureString("SOS(Y)", &w, &h);
	x = DL_NOTIFY_YES_X+(DL_NOTIFY_YES_W-w)/2;
	y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
	LCD_ShowString(x,y,"SOS(Y)");

	LCD_DrawRectangle(DL_NOTIFY_NO_X, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_W, DL_NOTIFY_NO_H);
	LCD_MeasureString("PWR(N)", &w, &h);
	x = DL_NOTIFY_NO_X+(DL_NOTIFY_NO_W-w)/2;
	y = DL_NOTIFY_NO_Y+(DL_NOTIFY_NO_H-h)/2;	
	LCD_ShowString(x,y,"PWR(N)");

