duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	SetRightKeyUpHandler(dl_start);
	SetLeftKeyUpHandler(dl_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_YES_X, DL_NOTIFY_YES_X+DL_NOTIFY_YES_W, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H, dl_start);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_NO_X, DL_NOTIFY_NO_X+DL_NOTIFY_NO_W, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_Y+DL_NOTIFY_NO_H, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);
#endif

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
}

void DlUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint8_t strbuf[256] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;
	
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif

	switch(get_dl_status())
	{
	case DL_STATUS_PREPARE:
		flag = false;
		break;
		
	case DL_STATUS_LINKING:
		{
			uint16_t str_linking[LANGUAGE_MAX][33] = 
				{
				#ifndef FW_FOR_CN
					{0x004C,0x0069,0x006E,0x006B,0x0069,0x006E,0x0067,0x0020,0x0074,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Linking to server...
					{0x0056,0x0065,0x0072,0x006C,0x0069,0x006E,0x006B,0x0075,0x006E,0x0067,0x0020,0x007A,0x0075,0x006D,0x0020,0x0053,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Verlinkung zum Server...
					{0x0043,0x006F,0x006E,0x006E,0x0065,0x0078,0x0069,0x006F,0x006E,0x0020,0x0061,0x0075,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0075,0x0072,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x002E,0x002E,0x002E,0x0000},//Connexion au serveur en cours...
					{0x0043,0x006F,0x006E,0x006E,0x0065,0x0073,0x0073,0x0069,0x006F,0x006E,0x0065,0x0020,0x0061,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Connessione al server ...
					{0x0045,0x006E,0x006C,0x0061,0x0063,0x0065,0x0020,0x0061,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000},//Enlace al servidor ...
					{0x0056,0x0069,0x006E,0x0063,0x0075,0x006C,0x0061,0x006E,0x0064,0x006F,0x0020,0x0061,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x002E,0x002E,0x002E,0x0000},//Vinculando ao servidor...
					{0x0141,0x0105,0x0063,0x007A,0x0065,0x006E,0x0069,0x0065,0x0020,0x007A,0x0020,0x0073,0x0065,0x0072,0x0077,0x0065,0x0072,0x0065,0x006D,0x002E,0x002E,0x002E,0x0000},//??czenie z serwerem...
					{0x004C,0x00E4,0x006E,0x006B,0x0061,0x0072,0x0020,0x0074,0x0069,0x006C,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x006E,0x002E,0x002E,0x002E,0x0000},//L?nkar till servern...
					{0x30B5,0x30FC,0x30D0,0x30FC,0x306B,0x63A5,0x7D9A,0x4E2D,0x002E,0x002E,0x002E,0x0000},//サーバーに接続中...
					{0xC11C,0xBC84,0xC5D0,0x0020,0xC5F0,0xACB0,0x0020,0xC911,0x002E,0x002E,0x002E,0x0000},//??? ?? ?...
					{0x041F,0x043E,0x0434,0x043A,0x043B,0x044E,0x0447,0x0435,0x043D,0x0438,0x0435,0x0020,0x043A,0x0020,0x0441,0x0435,0x0440,0x0432,0x0435,0x0440,0x0443,0x002E,0x002E,0x002E,0x0000},//Подключение к серверу...
					{0x0627,0x0644,0x0627,0x0631,0x062A,0x0628,0x0627,0x0637,0x0020,0x0628,0x0627,0x0644,0x062E,0x0627,0x062F,0x0645,0x002E,0x002E,0x002E,0x0000},//???????? ???????...
				#else
					{0x8FDE,0x63A5,0x670D,0x52A1,0x5668,0x2026,0x0000},//连接服务器…
					{0x004C,0x0069,0x006E,0x006B,0x0069,0x006E,0x0067,0x0020,0x0074,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Linking to server...
				#endif
				};
			
			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_linking[global_settings.language]);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X,
						  DL_NOTIFY_STRING_Y,
						  DL_NOTIFY_STRING_W,
						  DL_NOTIFY_STRING_H,
						  "Linking to server...");
		#endif
			ClearAllKeyHandler();
		}
		break;
		
	case DL_STATUS_DOWNLOADING:
		if(!flag)
		{
			uint16_t str_downloading[LANGUAGE_MAX][31] = {
											#ifndef FW_FOR_CN
													{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0069,0x006E,0x0067,0x002E,0x002E,0x002E,0x0000},//Upgrading...
													{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0077,0x0069,0x0072,0x0064,0x0020,0x0064,0x0075,0x0072,0x0063,0x0068,0x0067,0x0065,0x0066,0x00FC,0x0068,0x0072,0x0074,0x002E,0x002E,0x002E,0x0000},//Upgrade wird durchgeführt...
													{0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x002E,0x002E,0x002E,0x0000},//Mise à jour en cours...
													{0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x002E,0x002E,0x002E,0x0000},//Aggiornamento...
													{0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x006E,0x0064,0x006F,0x002E,0x002E,0x002E,0x0000},//Actualizando...
													{0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x006E,0x0064,0x006F,0x002E,0x002E,0x002E,0x0000},//Atualizando...
													{0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x006F,0x0070,0x0072,0x006F,0x0067,0x0072,0x0061,0x006D,0x006F,0x0077,0x0061,0x006E,0x0069,0x0061,0x002E,0x002E,0x002E,0x0000},//Aktualizacja oprogramowania...
													{0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0061,0x0072,0x002E,0x002E,0x002E,0x0000},//Uppgraderar...
													{0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x3092,0x7D9A,0x3051,0x307E,0x3059,0x304B,0xFF1F,0x0000},//アップグレード中…
													{0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xC911,0x2026,0x0000},//????? ?…
													{0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x002E,0x002E,0x002E,0x0000},//Обновление...
													{0x062C,0x0627,0x0631,0x064A,0x0020,0x0627,0x0644,0x062A,0x0631,0x0642,0x064A,0x0629,0x002E,0x002E,0x002E,0x0000},//???? ???????...
											#else
													{0x5347,0x7EA7,0x4E2D,0x2026,0x0000},//升级中…
													{0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0069,0x006E,0x0067,0x002E,0x002E,0x002E,0x0000},//Upgrading...
											#endif
												};
			flag = true;
			
			LCD_Fill(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_downloading[global_settings.language]);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X, 
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  40,
							  "Upgrading...");
		#endif
			LCD_DrawRectangle(DL_NOTIFY_PRO_X, DL_NOTIFY_PRO_Y, DL_NOTIFY_PRO_W, DL_NOTIFY_PRO_H);
			LCD_Fill(DL_NOTIFY_PRO_X+1, DL_NOTIFY_PRO_Y+1, DL_NOTIFY_PRO_W-1, DL_NOTIFY_PRO_H-1, BLACK);

			sprintf(pro_buf, "%d%%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			pro_str_x = DL_NOTIFY_PRO_NUM_X+(DL_NOTIFY_PRO_NUM_W-w)/2;
			pro_str_y = DL_NOTIFY_PRO_NUM_Y+(DL_NOTIFY_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}
		else
		{
			pro_len = (g_dl_progress*DL_NOTIFY_PRO_W)/100;
			LCD_Fill(DL_NOTIFY_PRO_X+1, DL_NOTIFY_PRO_Y+1, pro_len, DL_NOTIFY_PRO_H-1, WHITE);

			sprintf(pro_buf, "%d%%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}

		ClearAllKeyHandler();
		break;
		
