duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	case DL_STATUS_FINISHED:
		{
			uint16_t str_finish[LANGUAGE_MAX][37] = 
				{
				#ifndef FW_FOR_CN
					{
						//Upgraded successfully!
						0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0064,0x0020,0x0073,0x0075,0x0063,0x0063,0x0065,0x0073,0x0073,
						0x0066,0x0075,0x006C,0x006C,0x0079,0x0021,0x0000
					},
					{
						//Upgrade erfolgreich!
						0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0065,0x0072,0x0066,0x006F,0x006C,0x0067,0x0072,0x0065,
						0x0069,0x0063,0x0068,0x0021,0x0000
					},
					{
						////Mise à jour réussie?!
						0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0072,0x00E9,0x0075,0x0073,
						0x0073,0x0069,0x0065,0x00A0,0x0021,0x0000
					},
					{
						//Aggiornamento eseguito con successo!
						0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0065,0x0073,
						0x0065,0x0067,0x0075,0x0069,0x0074,0x006F,0x0020,0x0063,0x006F,0x006E,0x0020,0x0073,0x0075,0x0063,0x0063,0x0065,
						0x0073,0x0073,0x006F,0x0021,0x0000
					},
					{
						//?Actualizado exitosamente!
						0x00A1,0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0064,0x006F,0x0020,0x0065,0x0078,0x0069,
						0x0074,0x006F,0x0073,0x0061,0x006D,0x0065,0x006E,0x0074,0x0065,0x0021,0x0000
					},
					{
						//Atualizado com sucesso!
						0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0064,0x006F,0x0020,0x0063,0x006F,0x006D,0x0020,0x0073,
						0x0075,0x0063,0x0065,0x0073,0x0073,0x006F,0x0021,0x0000
					},
					{
						//Aktualizacja zakończona pomy?lnie!
						0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x007A,0x0061,0x006B,
						0x006F,0x0144,0x0063,0x007A,0x006F,0x006E,0x0061,0x0020,0x0070,0x006F,0x006D,0x0079,0x015B,0x006C,0x006E,0x0069,
						0x0065,0x0021,0x0000
					},
					{
						//Uppgraderingen lyckades!
						0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0065,0x006E,0x0020,0x006C,
						0x0079,0x0063,0x006B,0x0061,0x0064,0x0065,0x0073,0x0021,0x0000
					},
					{
						//アップグレードに成功しました!
						0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x306B,0x6210,0x529F,0x3057,0x307E,0x3057,0x305F,0x0021,0x0000
					},
					{
						//????? ??????????!
						0xC131,0xACF5,0xC801,0xC73C,0xB85C,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0xB418,0xC5C8,0xC2B5,0xB2C8,0xB2E4,
						0x0021,0x0000
					},
					{
						//Обновление успешно выполнено!
						0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0443,0x0441,0x043F,0x0435,0x0448,
						0x043D,0x043E,0x0020,0x0432,0x044B,0x043F,0x043E,0x043B,0x043D,0x0435,0x043D,0x043E,0x0021,0x0000
					},
					{
						//??? ??????? ?????!
						0x062A,0x0645,0x062A,0x0020,0x0627,0x0644,0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0628,0x0646,0x062C,0x0627,
						0x062D,0x0021,0x0000
					},
				#else
					{
						//升级成功！
						0x5347,0x7EA7,0x6210,0x529F,0xFF01,0x0000
					},
					{
						//Upgraded successfully!
						0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0064,0x0020,0x0073,0x0075,0x0063,0x0063,0x0065,0x0073,0x0073,
						0x0066,0x0075,0x006C,0x006C,0x0079,0x0021,0x0000
					},
				#endif
					};
			
			flag = false;
		
			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
			strcpy(strbuf, "Upgraded successfully!");
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_finish[global_settings.language]);
		#else	
			ShowStringsInRect(DL_NOTIFY_STRING_X,
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  DL_NOTIFY_STRING_H,
							  strbuf);
		#endif
		
			LCD_DrawRectangle(DL_NOTIFY_YES_X, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
			mmi_asc_to_ucs2(strbuf, "SOS(Y)");
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = DL_NOTIFY_YES_X+(DL_NOTIFY_YES_W-w)/2;
			y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
			LCD_ShowUniString(x,y,(uint16_t*)strbuf);

			LCD_DrawRectangle(DL_NOTIFY_NO_X, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_W, DL_NOTIFY_NO_H);
			mmi_asc_to_ucs2(strbuf, "PWR(N)");
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = DL_NOTIFY_NO_X+(DL_NOTIFY_NO_W-w)/2;
			y = DL_NOTIFY_NO_Y+(DL_NOTIFY_NO_H-h)/2;	
			LCD_ShowUniString(x,y,(uint16_t*)strbuf);

			SetRightKeyUpHandler(dl_reboot_confirm);
			SetLeftKeyUpHandler(dl_exit);
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_YES_X-10, DL_NOTIFY_YES_X+DL_NOTIFY_YES_W+10, DL_NOTIFY_YES_Y-10, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H+10, dl_reboot_confirm);
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_NO_X-10, DL_NOTIFY_NO_X+DL_NOTIFY_NO_W+10, DL_NOTIFY_NO_Y-10, DL_NOTIFY_NO_Y+DL_NOTIFY_NO_H+10, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);
		#endif	

			k_timer_stop(&mainmenu_timer);
			k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
			}
		break;
		
	case DL_STATUS_ERROR:
		{
			uint16_t str_fail[LANGUAGE_MAX][83] = {
												#ifndef FW_FOR_CN
													{
														//Upgrade failed, please check the network or server.
														0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0061,0x0069,0x006C,0x0065,0x0064,0x002C,0x0020,
														0x0070,0x006C,0x0065,0x0061,0x0073,0x0065,0x0020,0x0063,0x0068,0x0065,0x0063,0x006B,0x0020,0x0074,0x0068,0x0065,
														0x0020,0x006E,0x0065,0x0074,0x0077,0x006F,0x0072,0x006B,0x0020,0x006F,0x0072,0x0020,0x0073,0x0065,0x0072,0x0076,
														0x0065,0x0072,0x002E,0x0000
													},
													{
														//Das Upgrade ist fehlgeschlagen. Bitte überprüfen Sie das Netzwerk oder den Server.
														0x0044,0x0061,0x0073,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0069,0x0073,0x0074,0x0020,
														0x0066,0x0065,0x0068,0x006C,0x0067,0x0065,0x0073,0x0063,0x0068,0x006C,0x0061,0x0067,0x0065,0x006E,0x002E,0x0020,
														0x0042,0x0069,0x0074,0x0074,0x0065,0x0020,0x00FC,0x0062,0x0065,0x0072,0x0070,0x0072,0x00FC,0x0066,0x0065,0x006E,
														0x0020,0x0053,0x0069,0x0065,0x0020,0x0064,0x0061,0x0073,0x0020,0x004E,0x0065,0x0074,0x007A,0x0077,0x0065,0x0072,
														0x006B,0x0020,0x006F,0x0064,0x0065,0x0072,0x0020,0x0064,0x0065,0x006E,0x0020,0x0053,0x0065,0x0072,0x0076,0x0065,
														0x0072,0x002E,0x0000
													},
													{
														//La mise à niveau a échoué, veuillez vérifier le réseau ou le serveur.
														0x004C,0x0061,0x0020,0x006D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,
														0x0020,0x0061,0x0020,0x00E9,0x0063,0x0068,0x006F,0x0075,0x00E9,0x002C,0x0020,0x0076,0x0065,0x0075,0x0069,0x006C,
														0x006C,0x0065,0x007A,0x0020,0x0076,0x00E9,0x0072,0x0069,0x0066,0x0069,0x0065,0x0072,0x0020,0x006C,0x0065,0x0020,
														0x0072,0x00E9,0x0073,0x0065,0x0061,0x0075,0x0020,0x006F,0x0075,0x0020,0x006C,0x0065,0x0020,0x0073,0x0065,0x0072,
														0x0076,0x0065,0x0075,0x0072,0x002E,0x0000
													},
													{
														//Aggiornamento non riuscito, controllare la rete o il server.
														0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x006E,0x006F,
														0x006E,0x0020,0x0072,0x0069,0x0075,0x0073,0x0063,0x0069,0x0074,0x006F,0x002C,0x0020,0x0063,0x006F,0x006E,0x0074,
														0x0072,0x006F,0x006C,0x006C,0x0061,0x0072,0x0065,0x0020,0x006C,0x0061,0x0020,0x0072,0x0065,0x0074,0x0065,0x0020,
														0x006F,0x0020,0x0069,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x002E,0x0000
													},
													{
														//La actualización falló, verifique la red o el servidor.
														0x004C,0x0061,0x0020,0x0061,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,
														0x0020,0x0066,0x0061,0x006C,0x006C,0x00F3,0x002C,0x0020,0x0076,0x0065,0x0072,0x0069,0x0066,0x0069,0x0071,0x0075,
														0x0065,0x0020,0x006C,0x0061,0x0020,0x0072,0x0065,0x0064,0x0020,0x006F,0x0020,0x0065,0x006C,0x0020,0x0073,0x0065,
														0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x002E,0x0000
													},
													{
														//Falha na atualiza??o, verifique a rede ou o servidor.
														0x0046,0x0061,0x006C,0x0068,0x0061,0x0020,0x006E,0x0061,0x0020,0x0061,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,
														0x0061,0x00E7,0x00E3,0x006F,0x002C,0x0020,0x0076,0x0065,0x0072,0x0069,0x0066,0x0069,0x0071,0x0075,0x0065,0x0020,
														0x0061,0x0020,0x0072,0x0065,0x0064,0x0065,0x0020,0x006F,0x0075,0x0020,0x006F,0x0020,0x0073,0x0065,0x0072,0x0076,
														0x0069,0x0064,0x006F,0x0072,0x002E,0x0000
													},
													{
														//Aktualizacja nie powiod?a si?. Sprawd? sie? lub serwer.
														0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x006E,0x0069,0x0065,
														0x0020,0x0070,0x006F,0x0077,0x0069,0x006F,0x0064,0x0142,0x0061,0x0020,0x0073,0x0069,0x0119,0x002E,0x0020,0x0053,
														0x0070,0x0072,0x0061,0x0077,0x0064,0x017A,0x0020,0x0073,0x0069,0x0065,0x0107,0x0020,0x006C,0x0075,0x0062,0x0020,
														0x0073,0x0065,0x0072,0x0077,0x0065,0x0072,0x002E,0x0000
													},
													{
														//Uppgraderingen misslyckades, kontrollera n?tverket eller servern.
														0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0065,0x006E,0x0020,0x006D,
														0x0069,0x0073,0x0073,0x006C,0x0079,0x0063,0x006B,0x0061,0x0064,0x0065,0x0073,0x002C,0x0020,0x006B,0x006F,0x006E,
														0x0074,0x0072,0x006F,0x006C,0x006C,0x0065,0x0072,0x0061,0x0020,0x006E,0x00E4,0x0074,0x0076,0x0065,0x0072,0x006B,
														0x0065,0x0074,0x0020,0x0065,0x006C,0x006C,0x0065,0x0072,0x0020,0x0073,0x0065,0x0072,0x0076,0x0065,0x0072,0x006E,
														0x002E,0x0000
													},
													{
														//アップグレードに失敗しました。ネットワークまたはサーバーを確認してください。
														0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x306B,0x5931,0x6557,0x3057,0x307E,0x3057,0x305F,0x3002,0x30CD,
														0x30C3,0x30C8,0x30EF,0x30FC,0x30AF,0x307E,0x305F,0x306F,0x30B5,0x30FC,0x30D0,0x30FC,0x3092,0x78BA,0x8A8D,0x3057,
														0x3066,0x304F,0x3060,0x3055,0x3044,0x3002,0x0000
													},
													{
														//?????? ??????. ????? ??? ?????.
														0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0xC5D0,0x0020,0xC2E4,0xD328,0xD588,0xC2B5,0xB2C8,0xB2E4,0x002E,0x0020,0xB124,
														0xD2B8,0xC6CC,0xD06C,0xB098,0x0020,0xC11C,0xBC84,0xB97C,0x0020,0xD655,0xC778,0xD558,0xC138,0xC694,0x002E,0x0000
													},
													{
														//Обновление не удалось, проверьте сеть или сервер.
														0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x043D,0x0435,0x0020,0x0443,0x0434,
														0x0430,0x043B,0x043E,0x0441,0x044C,0x002C,0x0020,0x043F,0x0440,0x043E,0x0432,0x0435,0x0440,0x044C,0x0442,0x0435,
														0x0020,0x0441,0x0435,0x0442,0x044C,0x0020,0x0438,0x043B,0x0438,0x0020,0x0441,0x0435,0x0440,0x0432,0x0435,0x0440,
														0x002E,0x0000
													},
													{
														//???? ????? ???????? ???? ?????? ?? ?????? ?? ??????.
														0x0641,0x0634,0x0644,0x062A,0x0020,0x0639,0x0645,0x0644,0x064A,0x0629,0x0020,0x0627,0x0644,0x062A,0x0631,0x0642,
														0x064A,0x0629,0x060C,0x0020,0x064A,0x0631,0x062C,0x0649,0x0020,0x0627,0x0644,0x062A,0x062D,0x0642,0x0642,0x0020,
														0x0645,0x0646,0x0020,0x0627,0x0644,0x0634,0x0628,0x0643,0x0629,0x0020,0x0623,0x0648,0x0020,0x0627,0x0644,0x062E,
														0x0627,0x062F,0x0645,0x002E,0x0000
													},
												#else
													{
														//升级失败，请检查网络或服务器。
														0x5347,0x7EA7,0x5931,0x8D25,0xFF0C,0x8BF7,0x68C0,0x67E5,0x7F51,0x7EDC,0x6216,0x670D,0x52A1,0x5668,0x3002,0x0000
													},
													{
														//Upgrade failed, please check the network or server.
														0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0061,0x0069,0x006C,0x0065,0x0064,0x002C,0x0020,
														0x0070,0x006C,0x0065,0x0061,0x0073,0x0065,0x0020,0x0063,0x0068,0x0065,0x0063,0x006B,0x0020,0x0074,0x0068,0x0065,
														0x0020,0x006E,0x0065,0x0074,0x0077,0x006F,0x0072,0x006B,0x0020,0x006F,0x0072,0x0020,0x0073,0x0065,0x0072,0x0076,
														0x0065,0x0072,0x002E,0x0000
													},
												#endif
												};
			
